NYUAD-LabOps/Eagle_Parts/PDFs/Power Meter/ATM90E2x_V1.15/Firmware/SAM4C-CB/Atmel Studio 7.0/SAM4C_90e_xx_std/src/app/at90e_xx/at90e_xx.c
//===================================================================
#include "AT90E_xx.h"

/// @cond 0
/**INDENT-OFF**/
#ifdef __cplusplus
extern "C" {
#endif
/**INDENT-ON**/
/// @endcond

//#define	AFE90E25_RegNum_Max		52
//const	uint8_t	afe90e25_regadr_table[AFE90E25_RegNum_Max]=
//{
//	SoftRest,SysStatus,FuncEn,SagTH,SmallPMod,LastSPIData,		//1-6
//	CalStart,PLconstH,PLcosntL,Lgain,Lphi,Ngain,Nphi,PStartTH,PNolTH,QStartTH,QNolTH,MMode,CS1,		//1-13
//	AdjStart,Ugain,IgainL,IgainN,Uoffset,IoffsetL,IoffsetN,PoffsetL,PoffsetN,QoffsetL,QoffsetN,CS2,			//1-12
//	APenegy,ANenergy,ATenergy,RPenergy,RNenergy,RTenergy,Enstatus,Irms,Urms,Pmean,Qmean,Freq,PowerF,Pangle,Smean,	//1-15
//	Irms2,Pmean2,Qmean2,PowerF2,Pangle2,Smean2		//1-6	
//}; 
//#define	AFE90E2x_cmd_reg_E2_NumMax	(16+12)
const	AFE_CMD_REG_E2Adr_Str	afe90e2x_cmd_reg_e2adr_tbl[AFE90E2x_cmd_reg_E2_NumMax]=
{
	{0xD002,	FuncEn,			E2_AT90E2x_FunEn},
	{0xD003,	SagTH,			E2_AT90E2x_SagTTH},
	{0xD004,	SmallPMod,		E2_AT90E2x_SmallPMod},
	{0xD020,	CalStart,		E2_AT90E2x_CalStart},	
	{0xD021,	PLconstH,		E2_AT90E2x_PLConstH},
	{0xD022,	PLcosntL,		E2_AT90E2x_PLConstL},
	{0xD023,	Lgain,			E2_AT90E2x_LGain},
	{0xD024,	Lphi,			E2_AT90E2x_LPhi},
	{0xD025,	Ngain,			E2_AT90E2x_NGain},
	{0xD026,	Nphi,			E2_AT90E2x_NPhi},
	{0xD027,	PStartTH,		E2_AT90E2x_PStartTH},
	{0xD028,	PNolTH,			E2_AT90E2x_PNolTH},
	{0xD029,	QStartTH,		E2_AT90E2x_QStartTH},
	{0xD02A,	QNolTH,			E2_AT90E2x_QNolTH},
	{0xD02B,	MMode,			E2_AT90E2x_MMode},
	{0xD02C,	CS1,			E2_AT90E2x_CS1},
	{0xD030,	AdjStart,		E2_AT90E2x_AdjStart},
	{0xD031,	Ugain,			E2_AT90E2x_Ugain},
	{0xD032,	IgainL,			E2_AT90E2x_IgainL},
	{0xD033,	IgainN,			E2_AT90E2x_IgainN},
	{0xD034,	Uoffset,		E2_AT90E2x_Uoffset},
	{0xD035,	IoffsetL,		E2_AT90E2x_IoffsetL},
	{0xD036,	IoffsetN,		E2_AT90E2x_IoffsetN},
	{0xD037,	PoffsetL,		E2_AT90E2x_PoffsetL},
	{0xD039,	PoffsetN,		E2_AT90E2x_PoffsetN},
	{0xD038,	QoffsetL,		E2_AT90E2x_QoffsetL},
	{0xD03A,	QoffsetN,		E2_AT90E2x_QoffsetN},
	{0xD03B,	CS2,			E2_AT90E2x_CS2}		
};
//#define	AFE90E3x_cmd_reg_E2_NumMax	(8*16+14)
const	AFE_CMD_REG_E2Adr_Str	afe90e3x_cmd_reg_e2adr_tbl[AFE90E3x_cmd_reg_E2_NumMax]=
{
	{0xD000,	0x00,			E2_AT90E3x_000_Register},
	{0xD001,	0x01,			E2_AT90E3x_001_Register},
	{0xD002,	0x02,			E2_AT90E3x_002_Register},
	{0xD003,	0x03,			E2_AT90E3x_003_Register},
	{0xD004,	0x04,			E2_AT90E3x_004_Register},
	{0xD005,	0x05,			E2_AT90E3x_005_Register},
	{0xD006,	0x06,			E2_AT90E3x_006_Register},
	{0xD007,	0x07,			E2_AT90E3x_007_Register},
	{0xD008,	0x08,			E2_AT90E3x_008_Register},
	{0xD009,	0x09,			E2_AT90E3x_009_Register},
	{0xD00A,	0x0A,			E2_AT90E3x_00A_Register},
	{0xD00B,	0x0B,			E2_AT90E3x_00B_Register},
	{0xD00C,	0x0C,			E2_AT90E3x_00C_Register},
	{0xD00D,	0x0D,			E2_AT90E3x_00D_Register},
	{0xD00E,	0x0E,			E2_AT90E3x_00E_Register},
	{0xD00F,	0x0F,			E2_AT90E3x_00F_Register},
	
	{0xD010,	0x10,			E2_AT90E3x_010_Register},
	{0xD011,	0x11,			E2_AT90E3x_011_Register},
	{0xD012,	0x12,			E2_AT90E3x_012_Register},
	{0xD013,	0x13,			E2_AT90E3x_013_Register},
	{0xD014,	0x14,			E2_AT90E3x_014_Register},
	{0xD015,	0x15,			E2_AT90E3x_015_Register},
	{0xD016,	0x16,			E2_AT90E3x_016_Register},
	{0xD017,	0x17,			E2_AT90E3x_017_Register},
	{0xD018,	0x18,			E2_AT90E3x_018_Register},
	{0xD019,	0x19,			E2_AT90E3x_019_Register},
	{0xD01A,	0x1A,			E2_AT90E3x_01A_Register},
	{0xD01B,	0x1B,			E2_AT90E3x_01B_Register},
	{0xD01C,	0x1C,			E2_AT90E3x_01C_Register},
	{0xD01D,	0x1D,			E2_AT90E3x_01D_Register},
	{0xD01E,	0x1E,			E2_AT90E3x_01E_Register},
	{0xD01F,	0x1F,			E2_AT90E3x_01F_Register},
	
	{0xD020,	0x20,			E2_AT90E3x_020_Register},
	{0xD021,	0x21,			E2_AT90E3x_021_Register},
	{0xD022,	0x22,			E2_AT90E3x_022_Register},
	{0xD023,	0x23,			E2_AT90E3x_023_Register},
	{0xD024,	0x24,			E2_AT90E3x_024_Register},
	{0xD025,	0x25,			E2_AT90E3x_025_Register},
	{0xD026,	0x26,			E2_AT90E3x_026_Register},
	{0xD027,	0x27,			E2_AT90E3x_027_Register},
	{0xD028,	0x28,			E2_AT90E3x_028_Register},
	{0xD029,	0x29,			E2_AT90E3x_029_Register},
	{0xD02A,	0x2A,			E2_AT90E3x_02A_Register},
	{0xD02B,	0x2B,			E2_AT90E3x_02B_Register},
	{0xD02C,	0x2C,			E2_AT90E3x_02C_Register},
	{0xD02D,	0x2D,			E2_AT90E3x_02D_Register},
	{0xD02E,	0x2E,			E2_AT90E3x_02E_Register},
	{0xD02F,	0x2F,			E2_AT90E3x_02F_Register},
	
	{0xD030,	0x30,			E2_AT90E3x_030_Register},
	{0xD031,	0x31,			E2_AT90E3x_031_Register},
	{0xD032,	0x32,			E2_AT90E3x_032_Register},
	{0xD033,	0x33,			E2_AT90E3x_033_Register},
	{0xD034,	0x34,			E2_AT90E3x_034_Register},
	{0xD035,	0x35,			E2_AT90E3x_035_Register},
	{0xD036,	0x36,			E2_AT90E3x_036_Register},
	{0xD037,	0x37,			E2_AT90E3x_037_Register},
	{0xD038,	0x38,			E2_AT90E3x_038_Register},
	{0xD039,	0x39,			E2_AT90E3x_039_Register},
	{0xD03A,	0x3A,			E2_AT90E3x_03A_Register},
	{0xD03B,	0x3B,			E2_AT90E3x_03B_Register},
	{0xD03C,	0x3C,			E2_AT90E3x_03C_Register},
	{0xD03D,	0x3D,			E2_AT90E3x_03D_Register},
	{0xD03E,	0x3E,			E2_AT90E3x_03E_Register},
	{0xD03F,	0x3F,			E2_AT90E3x_03F_Register},	
	
	{0xD040,	0x40,			E2_AT90E3x_040_Register},
	{0xD041,	0x41,			E2_AT90E3x_041_Register},
	{0xD042,	0x42,			E2_AT90E3x_042_Register},
	{0xD043,	0x43,			E2_AT90E3x_043_Register},
	{0xD044,	0x44,			E2_AT90E3x_044_Register},
	{0xD045,	0x45,			E2_AT90E3x_045_Register},
	{0xD046,	0x46,			E2_AT90E3x_046_Register},
	{0xD047,	0x47,			E2_AT90E3x_047_Register},
	{0xD048,	0x48,			E2_AT90E3x_048_Register},
	{0xD049,	0x49,			E2_AT90E3x_049_Register},
	{0xD04A,	0x4A,			E2_AT90E3x_04A_Register},
	{0xD04B,	0x4B,			E2_AT90E3x_04B_Register},
	{0xD04C,	0x4C,			E2_AT90E3x_04C_Register},
	{0xD04D,	0x4D,			E2_AT90E3x_04D_Register},
	{0xD04E,	0x4E,			E2_AT90E3x_04E_Register},
	{0xD04F,	0x4F,			E2_AT90E3x_04F_Register},
	
	{0xD050,	0x50,			E2_AT90E3x_050_Register},
	{0xD051,	0x51,			E2_AT90E3x_051_Register},
	{0xD052,	0x52,			E2_AT90E3x_052_Register},
	{0xD053,	0x53,			E2_AT90E3x_053_Register},
	{0xD054,	0x54,			E2_AT90E3x_054_Register},
	{0xD055,	0x55,			E2_AT90E3x_055_Register},
	{0xD056,	0x56,			E2_AT90E3x_056_Register},
	{0xD057,	0x57,			E2_AT90E3x_057_Register},
	{0xD058,	0x58,			E2_AT90E3x_058_Register},
	{0xD059,	0x59,			E2_AT90E3x_059_Register},
	{0xD05A,	0x5A,			E2_AT90E3x_05A_Register},
	{0xD05B,	0x5B,			E2_AT90E3x_05B_Register},
	{0xD05C,	0x5C,			E2_AT90E3x_05C_Register},
	{0xD05D,	0x5D,			E2_AT90E3x_05D_Register},
	{0xD05E,	0x5E,			E2_AT90E3x_05E_Register},
	{0xD05F,	0x5F,			E2_AT90E3x_05F_Register},
	
	{0xD060,	0x60,			E2_AT90E3x_060_Register},
	{0xD061,	0x61,			E2_AT90E3x_061_Register},
	{0xD062,	0x62,			E2_AT90E3x_062_Register},
	{0xD063,	0x63,			E2_AT90E3x_063_Register},
	{0xD064,	0x64,			E2_AT90E3x_064_Register},
	{0xD065,	0x65,			E2_AT90E3x_065_Register},
	{0xD066,	0x66,			E2_AT90E3x_066_Register},
	{0xD067,	0x67,			E2_AT90E3x_067_Register},
	{0xD068,	0x68,			E2_AT90E3x_068_Register},
	{0xD069,	0x69,			E2_AT90E3x_069_Register},
	{0xD06A,	0x6A,			E2_AT90E3x_06A_Register},
	{0xD06B,	0x6B,			E2_AT90E3x_06B_Register},
	{0xD06C,	0x6C,			E2_AT90E3x_06C_Register},
	{0xD06D,	0x6D,			E2_AT90E3x_06D_Register},
	{0xD06E,	0x6E,			E2_AT90E3x_06E_Register},
	{0xD06F,	0x6F,			E2_AT90E3x_06F_Register},
	
	{0xD070,	0x70,			E2_AT90E3x_070_Register},
	{0xD071,	0x71,			E2_AT90E3x_071_Register},
	{0xD072,	0x72,			E2_AT90E3x_072_Register},
	{0xD073,	0x73,			E2_AT90E3x_073_Register},
	{0xD074,	0x74,			E2_AT90E3x_074_Register},
	{0xD075,	0x75,			E2_AT90E3x_075_Register},
	{0xD076,	0x76,			E2_AT90E3x_076_Register},
	{0xD077,	0x77,			E2_AT90E3x_077_Register},
	{0xD078,	0x78,			E2_AT90E3x_078_Register},
	{0xD079,	0x79,			E2_AT90E3x_079_Register},
	{0xD07A,	0x7A,			E2_AT90E3x_07A_Register},
	{0xD07B,	0x7B,			E2_AT90E3x_07B_Register},
	{0xD07C,	0x7C,			E2_AT90E3x_07C_Register},
	{0xD07D,	0x7D,			E2_AT90E3x_07D_Register},
	{0xD07E,	0x7E,			E2_AT90E3x_07E_Register},
	{0xD07F,	0x7F,			E2_AT90E3x_07F_Register},
		
	{0xD800,	P3_BGCurveK,		E2_AT90E3x_800_Register},
	{0xD802,	P3_TEMP_COMP_GAIN,	E2_AT90E3x_802_Register},
	{0xD803,	P3_TEMP_COMP_REF,	E2_AT90E3x_803_Register},	
	{0xD804,	P3_PMIGainA,		E2_AT90E3x_804_Register},
	{0xD805,	P3_PMIGainB,		E2_AT90E3x_805_Register},
	{0xD806,	P3_PMIGainC,        E2_AT90E3x_806_Register},
	{0xD808,	P3_BG_TEMP_P12,     E2_AT90E3x_808_Register},
	{0xD809,	P3_BG_TEMP_P34,		E2_AT90E3x_809_Register},
	{0xD80A,	P3_BG_TEMP_P56,		E2_AT90E3x_80A_Register},
	{0xD80B,	P3_BG_TEMP_P78,		E2_AT90E3x_80B_Register},
	{0xD80C,	P3_BG_TEMP_N12,		E2_AT90E3x_80C_Register},
	{0xD80D,	P3_BG_TEMP_N34,		E2_AT90E3x_80D_Register},
	{0xD80E,	P3_BG_TEMP_N56,		E2_AT90E3x_80E_Register},
	{0xD80F,	P3_BG_TEMP_N78,		E2_AT90E3x_80F_Register}	
};


