NYUAD-LabOps/Eagle_Parts/PDFs/Power Meter/ATM90E2x_V1.15/Firmware/SAM4C-CB/Atmel Studio 7.0/SAM4C_90e_xx_std/src/app/at90e_xx/at90e_xx.c
//---------------------------------------------------------  
AFE_Str		VAFE;

//=========================================================
//decription	::	AFE DMA is enable
//function		::	AFE_DMA_ENABLE
//Input			::	none
//Output		::	AFE_DMA=1
//call			::	none
//effect		::	none
//=========================================================
void	AFE_DMA_ENABLE(void)
{
	AFE_DMA_High();
}
//=========================================================
//decription	::	AFE DMA is disable
//function		::	AFE_DMA_DISABLE
//Input			::	none
//Output		::	AFE_DMA=0
//call			::	none
//effect		::	none
//=========================================================
void	AFE_DMA_DISABLE(void)
{
	AFE_DMA_Low();
}
//=========================================================
//decription	::	AFE is nomal mode
//function		::	AFE_Normal_MODE
//Input			::	none
//Output		::	AFE_PM1 =1 ,AFE_PM0 =1
//call			::	none
//effect		::	none
//=========================================================
void	AFE_Normal_MODE(void)
{
	AFE_PM1_High();
	AFE_PM0_High();
}
//=========================================================
//decription	::	AFE is patial mode
//function		::	AFE_Patial_MODE
//Input			::	none
//Output		::	AFE_PM1 =1 ,AFE_PM0 =0
//call			::	none
//effect		::	none
//=========================================================
void	AFE_Patial_MODE(void)
{
	AFE_PM1_High();
	AFE_PM0_Low();
}
//=========================================================
//decription	::	AFE is Detect mode
//function		::	AFE_Detect_MODE
//Input			::	none
//Output		::	AFE_PM1 =0 ,AFE_PM0 =1
//call			::	none
//effect		::	none
//=========================================================
void	AFE_Detect_MODE(void)
{
	AFE_PM1_Low();
	AFE_PM0_High();
}
//=========================================================
//decription	::	AFE is Idle mode
//function		::	AFE_Idle_MODE
//Input			::	none
//Output		::	AFE_PM1 =0 ,AFE_PM0 =0
//call			::	none
//effect		::	none
//=========================================================
void	AFE_Idle_MODE(void)
{
	AFE_PM1_Low();
	AFE_PM0_Low();	
}
//=========================================================
//decription	::	set AFE mode
//function		::	SET_AFE_MODE
//Input			::	mode
//Output		::	
//call			::	none
//effect		::	none
//=========================================================
void	SET_AFE_MODE( AFE_MODE mode )
{
	pmc_enable_periph_clk( AFE_PM0_ID );
	pmc_enable_periph_clk( AFE_PM1_ID );
	AFE_PM1_PIO_En();
	AFE_PM0_PIO_En();
	AFE_PM0_Out();
	AFE_PM1_Out();	
	VAFE.runmode =mode;
	switch (mode)
	{
		case	Idle_Mode:
		{
			AFE_Idle_MODE();
		}
		break;
		case	Detect_Mode:
		{
			AFE_Detect_MODE();
		}
		break;
		case	Patial_Mode:
		{	
			AFE_Patial_MODE();
		}
		break;
		case	Nomal_Mode:
		default:
		{
            AFE_Normal_MODE();           
		}
		break;
	}	
}

//=========================================================
//decription	::	AFE CS is enable
//function		::	AFE_CS_ENABLE
//Input			::	none
//Output		::	AFE_CS=0
//call			::	none
//effect		::	none
//=========================================================
void	AFE_CS_ENABLE(void)
{
	AFE_CS_Low();
}
//=========================================================
//decription	::	AFE CS is disable
//function		::	AFE_CS_DISABLE
//Input			::	none
//Output		::	AFE_CS=1
//call			::	none
//effect		::	none
//=========================================================
void	AFE_CS_DISABLE(void)
{
	AFE_CS_High();
}
//=========================================================
//decription	::	AFE configure zx0
//function		::	AFE_Configure_ZX0
//Input			::	none
//Output		::	none
//call			::	pmc_enable_periph_clk,pio_set_debounce_filter
//					gpio_configure_pin,pio_enable_interrupt
//effect		::	none
//=========================================================
void	AFE_Configure_ZX0(void)
{
	pmc_enable_periph_clk( AFE_ZX0_ID );
	AFE_ZX0_In();
	AFE_ZX0_PIO_En();
	AFE_ZX0_PullUp_En();
	AFE_ZX0_PIO->PIO_IFER |= AFE_ZX0_MASK;
	//AFE_ZX0_PIO->PIO_SCDR =20;
	AFE_ZX0_PIO->PIO_IFSCER |= AFE_ZX0_MASK;
	
	//pio_handler_set(AFE_ZX0_PIO, AFE_ZX0_ID, AFE_ZX0_MASK, AFE_ZX0_ATR, AFE_ZX0_INT_handler);
    pio_enable_interrupt(AFE_ZX0_PIO, AFE_ZX0_MASK);
	
	VAFE.IntNum[ZX0] =0;
	
    NVIC_DisableIRQ(AFE_ZX0_IRQn);
    NVIC_ClearPendingIRQ(AFE_ZX0_IRQn);
    NVIC_SetPriority(AFE_ZX0_IRQn, 0);
    NVIC_EnableIRQ(AFE_ZX0_IRQn);
}
//=========================================================
//decription	::	AFE ZX0 interrupt process
//function		::	AFE_ZX0_INT_handler
//Input			::	none
//Output		::	none
//call			::	none
//effect		::	none
//=========================================================
void	AFE_ZX0_INT_handler(uint32_t temp0, uint32_t temp1)
{
//	if( pio_get_interrupt_status( AFE_ZX0_PIO ) )
//	{
		if( !BIO_AFE_ZX0 )
		{
			VAFE.IntNum[ZX0] ++;
		}
//	}
}
//=========================================================
//decription	::	AFE configure zx1
//function		::	AFE_Configure_ZX1
//Input			::	none
//Output		::	none
//call			::	pmc_enable_periph_clk,pio_set_debounce_filter
//					gpio_configure_pin,pio_enable_interrupt
//effect		::	none
//=========================================================
void	AFE_Configure_ZX1(void)
{
	pmc_enable_periph_clk( AFE_ZX1_ID );
	AFE_ZX1_In();
	AFE_ZX1_PIO_En();
	AFE_ZX1_PullUp_En();
	AFE_ZX1_PIO->PIO_IFER |= AFE_ZX1_MASK;
	//AFE_ZX1_PIO->PIO_SCDR =20;
	AFE_ZX1_PIO->PIO_IFSCER |= AFE_ZX1_MASK;
	
	//pio_handler_set(AFE_ZX1_PIO, AFE_ZX1_ID, AFE_ZX1_MASK, AFE_ZX1_ATR, AFE_ZX1_INT_handler);
    pio_enable_interrupt(AFE_ZX1_PIO, AFE_ZX1_MASK);
	
	VAFE.IntNum[ZX1] =0;
	
    NVIC_DisableIRQ(AFE_ZX1_IRQn);
    NVIC_ClearPendingIRQ(AFE_ZX1_IRQn);
    NVIC_SetPriority(AFE_ZX1_IRQn, 0);
    NVIC_EnableIRQ(AFE_ZX1_IRQn); 
}
//=========================================================
//decription	::	AFE ZX1 interrupt process
//function		::	AFE_ZX1_INT_handler
//Input			::	none
//Output		::	none
//call			::	none
//effect		::	none
//=========================================================
void	AFE_ZX1_INT_handler(uint32_t temp0, uint32_t temp1)
{
//	if( pio_get_interrupt_status( AFE_ZX1_PIO ) )
//	{
		if( !BIO_AFE_ZX1 )
		{
			VAFE.IntNum[ZX1] ++;
		}
//	}
}
//=========================================================
//decription	::	AFE configure zx2
//function		::	AFE_Configure_ZX2
//Input			::	none
//Output		::	none
//call			::	pmc_enable_periph_clk,pio_set_debounce_filter
//					gpio_configure_pin,pio_enable_interrupt
//effect		::	none
//=========================================================
void	AFE_Configure_ZX2(void)
{
	pmc_enable_periph_clk( AFE_ZX2_ID );
	AFE_ZX2_In();
	AFE_ZX2_PIO_En();
	AFE_ZX2_PullUp_En();
	AFE_ZX2_PIO->PIO_IFER |= AFE_ZX2_MASK;
	//AFE_ZX2_PIO->PIO_SCDR =20;
	AFE_ZX2_PIO->PIO_IFSCER |= AFE_ZX2_MASK;
	
