NYUAD-LabOps/Eagle_Parts/PDFs/Power Meter/ATM90E2x_V1.15/Firmware/SAM4C-CB/Atmel Studio 7.0/SAM4C_90e_xx_std/src/app/at90e_xx/at90e_xx.c
	pio_handler_set(AFE_ZX2_PIO, AFE_ZX2_ID, AFE_ZX2_MASK, AFE_ZX2_ATR, AFE_ZX2_INT_handler);
    pio_enable_interrupt(AFE_ZX2_PIO, AFE_ZX2_MASK);
	
	VAFE.IntNum[ZX2] =0;
	
    NVIC_DisableIRQ(AFE_ZX2_IRQn);
    NVIC_ClearPendingIRQ(AFE_ZX2_IRQn);
    NVIC_SetPriority(AFE_ZX2_IRQn, 0);
    NVIC_EnableIRQ(AFE_ZX2_IRQn); 
}
//=========================================================
//decription	::	AFE ZX2 interrupt process
//function		::	AFE_ZX2_INT_handler
//Input			::	none
//Output		::	none
//call			::	none
//effect		::	none
//=========================================================
void	AFE_ZX2_INT_handler(uint32_t temp0, uint32_t temp1)
{
//	if( pio_get_interrupt_status( AFE_ZX2_PIO ) )
//	{
		if( !BIO_AFE_ZX2 )
		{
			VAFE.IntNum[ZX2] ++;
		}
//	}
}
//=========================================================
//decription	::	AFE configure CF1
//function		::	AFE_Configure_CF1
//Input			::	none
//Output		::	none
//call			::	pmc_enable_periph_clk,pio_set_debounce_filter
//					gpio_configure_pin,pio_enable_interrupt
//effect		::	none
//=========================================================
void	AFE_Configure_CF1(void)
{
	pmc_enable_periph_clk( AFE_CF1_ID );
	AFE_CF1_In();
	AFE_CF1_PIO_En();
	AFE_CF1_PullUp_En();
	AFE_CF1_PIO->PIO_IFER |= AFE_CF1_MASK;
	//AFE_CF1_PIO->PIO_SCDR =20;
	AFE_CF1_PIO->PIO_IFSCER |= AFE_CF1_MASK;
	
	pio_handler_set(AFE_CF1_PIO, AFE_CF1_ID, AFE_CF1_MASK, AFE_CF1_ATR, AFE_CF1_INT_handler);
    pio_enable_interrupt(AFE_CF1_PIO, AFE_CF1_MASK);
	
	VAFE.IntNum[CF1] =0;
	
    NVIC_DisableIRQ(AFE_CF1_IRQn);
    NVIC_ClearPendingIRQ(AFE_CF1_IRQn);
    NVIC_SetPriority(AFE_CF1_IRQn, 0);
    NVIC_EnableIRQ(AFE_CF1_IRQn);
}
//=========================================================
//decription	::	AFE CF1 interrupt process
//function		::	AFE_CF1_INT_handler
//Input			::	none
//Output		::	none
//call			::	none
//effect		::	none
//=========================================================
void	AFE_CF1_INT_handler(uint32_t temp0, uint32_t temp1)
{
//	if( pio_get_interrupt_status( AFE_CF1_PIO ) )
//	{
		if( !BIO_AFE_CF1 )
		{
			VAFE.IntNum[CF1] ++;
		}
//	}
}
//=========================================================
//decription	::	AFE configure CF2
//function		::	AFE_Configure_CF2
//Input			::	none
//Output		::	none
//call			::	pmc_enable_periph_clk,pio_set_debounce_filter
//					gpio_configure_pin,pio_enable_interrupt
//effect		::	none
//=========================================================
void	AFE_Configure_CF2(void)
{
	pmc_enable_periph_clk( AFE_CF2_ID );
	AFE_CF2_In();
	AFE_CF2_PIO_En();
	AFE_CF2_PullUp_En();
	AFE_CF2_PIO->PIO_IFER |= AFE_CF2_MASK;
	//AFE_CF2_PIO->PIO_SCDR =20;
	AFE_CF2_PIO->PIO_IFSCER |= AFE_CF2_MASK;
	
	pio_handler_set(AFE_CF2_PIO, AFE_CF2_ID, AFE_CF2_MASK, AFE_CF2_ATR, AFE_CF2_INT_handler);
    pio_enable_interrupt(AFE_CF2_PIO, AFE_CF2_MASK);
	
	VAFE.IntNum[CF2] =0;
	
    NVIC_DisableIRQ(AFE_CF2_IRQn);
    NVIC_ClearPendingIRQ(AFE_CF2_IRQn);
    NVIC_SetPriority(AFE_CF2_IRQn, 0);
    NVIC_EnableIRQ(AFE_CF2_IRQn);
}
//=========================================================
//decription	::	AFE CF2 interrupt process
//function		::	AFE_CF2_INT_handler
//Input			::	none
//Output		::	none
//call			::	none
//effect		::	none
//=========================================================
void	AFE_CF2_INT_handler(uint32_t temp0, uint32_t temp1)
{
//	if( pio_get_interrupt_status( AFE_CF2_PIO ) )
//	{
		if( !BIO_AFE_CF2 )
		{
			VAFE.IntNum[CF2] ++;
		}
//	}
}
//=========================================================
//decription	::	AFE configure CF3
//function		::	AFE_Configure_CF3
//Input			::	none
//Output		::	none
//call			::	pmc_enable_periph_clk,pio_set_debounce_filter
//					gpio_configure_pin,pio_enable_interrupt
//effect		::	none
//=========================================================
void	AFE_Configure_CF3(void)
{
	pmc_enable_periph_clk( AFE_CF3_ID );
	AFE_CF3_In();
	AFE_CF3_PIO_En();
	AFE_CF3_PullUp_En();
	AFE_CF3_PIO->PIO_IFER |= AFE_CF3_MASK;
	//AFE_CF3_PIO->PIO_SCDR =20;
	AFE_CF3_PIO->PIO_IFSCER |= AFE_CF3_MASK;
	
	pio_handler_set(AFE_CF3_PIO, AFE_CF3_ID, AFE_CF3_MASK, AFE_CF3_ATR, AFE_CF3_INT_handler);
    pio_enable_interrupt(AFE_CF3_PIO, AFE_CF3_MASK);
	
	VAFE.IntNum[CF3] =0;
	
    NVIC_DisableIRQ(AFE_CF3_IRQn);
    NVIC_ClearPendingIRQ(AFE_CF3_IRQn);
    NVIC_SetPriority(AFE_CF3_IRQn, 0);
    NVIC_EnableIRQ(AFE_CF3_IRQn);
}
//=========================================================
//decription	::	AFE CF3 interrupt process
//function		::	AFE_CF3_INT_handler
//Input			::	none
//Output		::	none
//call			::	none
//effect		::	none
//=========================================================
void	AFE_CF3_INT_handler(uint32_t temp0, uint32_t temp1)
{
//	if( pio_get_interrupt_status( AFE_CF3_PIO ) )
//	{
		if( !BIO_AFE_CF3 )
		{
			VAFE.IntNum[CF3] ++;
		}
//	}
}
//=========================================================
//decription	::	AFE configure CF4
//function		::	AFE_Configure_CF4
//Input			::	none
//Output		::	none
//call			::	pmc_enable_periph_clk,pio_set_debounce_filter
//					gpio_configure_pin,pio_enable_interrupt
//effect		::	none
//=========================================================
void	AFE_Configure_CF4(void)
{
	pmc_enable_periph_clk( AFE_CF4_ID );
	AFE_CF4_In();
	AFE_CF4_PIO_En();
	AFE_CF4_PullUp_En();
	AFE_CF4_PIO->PIO_IFER |= AFE_CF4_MASK;
	//AFE_CF4_PIO->PIO_SCDR =20;
	AFE_CF4_PIO->PIO_IFSCER |= AFE_CF4_MASK;
	
	pio_handler_set(AFE_CF4_PIO, AFE_CF4_ID, AFE_CF4_MASK, AFE_CF4_ATR, AFE_CF4_INT_handler);
    pio_enable_interrupt(AFE_CF4_PIO, AFE_CF4_MASK);
	
	VAFE.IntNum[CF4] =0;
	
    NVIC_DisableIRQ(AFE_CF4_IRQn);
    NVIC_ClearPendingIRQ(AFE_CF4_IRQn);
    NVIC_SetPriority(AFE_CF4_IRQn, 0);
    NVIC_EnableIRQ(AFE_CF4_IRQn); 
}
//=========================================================
//decription	::	AFE CF4 interrupt process
//function		::	AFE_CF4_INT_handler
//Input			::	none
//Output		::	none
//call			::	none
//effect		::	none
//=========================================================
void	AFE_CF4_INT_handler(uint32_t temp0, uint32_t temp1)
{
//	if( pio_get_interrupt_status( AFE_CF4_PIO ) )
//	{
		if( !BIO_AFE_CF4 )
		{
			VAFE.IntNum[CF4] ++;
		}
//	}
}
/*
//=========================================================
//decription	::	AFE configure IRQ0
//function		::	AFE_Configure_IRQ0
//Input			::	none
//Output		::	none
//call			::	pmc_enable_periph_clk,pio_set_debounce_filter
//					gpio_configure_pin,pio_enable_interrupt
//effect		::	none
//=========================================================
void	AFE_Configure_IRQ0(void)
{
	pmc_enable_periph_clk( AFE_IRQ0_ID );
	gpio_configure_pin(AFE_IRQ0_PIN, AFE_IRQ0_FLAGS);
	pio_set_debounce_filter(AFE_IRQ0_PIO, AFE_IRQ0_MASK, 20);
	pio_handler_set(AFE_IRQ0_PIO, AFE_IRQ0_ID, AFE_IRQ0_MASK, PIO_IT_FALL_EDGE, AFE_IRQ0_INT_handler);
	pio_enable_interrupt(AFE_IRQ0_PIO, AFE_IRQ0_MASK);
	VAFE.IntNum[IRQ0] =0;			
	NVIC_DisableIRQ(PIOA_IRQn);
	NVIC_ClearPendingIRQ(PIOA_IRQn);
	NVIC_SetPriority(PIOA_IRQn, 0);
	NVIC_EnableIRQ(PIOA_IRQn); 
}
//=========================================================
//decription	::	AFE IRQ0 interrupt process
//function		::	AFE_IRQ0_INT_handler
//Input			::	none
//Output		::	none
//call			::	none
//effect		::	none
//=========================================================
void	AFE_IRQ0_INT_handler(void)
{
//	if( pio_get_interrupt_status( AFE_IRQ0_PIO ) )
//	{
		if( !pio_get_pin_value( AFE_IRQ0_PIN ) )
		{
			VAFE.IntNum[IRQ0] ++;
		}
//	}
}
//=========================================================
//decription	::	AFE configure IRQ1
//function		::	AFE_Configure_IRQ1
//Input			::	none
//Output		::	none
//call			::	pmc_enable_periph_clk,pio_set_debounce_filter
//					gpio_configure_pin,pio_enable_interrupt
//effect		::	none
//=========================================================
void	AFE_Configure_IRQ1(void)
{
	pmc_enable_periph_clk( AFE_IRQ1_ID );
	gpio_configure_pin(AFE_IRQ1_PIN, AFE_IRQ1_FLAGS);
	pio_set_debounce_filter(AFE_IRQ1_PIO, AFE_IRQ1_MASK, 20);
	pio_handler_set(AFE_IRQ1_PIO, AFE_IRQ1_ID, AFE_IRQ1_MASK, PIO_IT_FALL_EDGE, AFE_IRQ1_INT_handler);
	pio_enable_interrupt(AFE_IRQ1_PIO, AFE_IRQ1_MASK);
	VAFE.IntNum[IRQ1] =0;			
	NVIC_DisableIRQ(PIOB_IRQn);
	NVIC_ClearPendingIRQ(PIOB_IRQn);
	NVIC_SetPriority(PIOB_IRQn, 0);
	NVIC_EnableIRQ(PIOB_IRQn); 
}
//=========================================================
//decription	::	AFE IRQ1 interrupt process
//function		::	AFE_IRQ1_INT_handler
//Input			::	none
//Output		::	none
//call			::	none
//effect		::	none
//=========================================================
void	AFE_IRQ1_INT_handler(void)
{
//	if( pio_get_interrupt_status( AFE_IRQ1_PIO ) )
//	{
		if( !pio_get_pin_value( AFE_IRQ1_PIN ) )
		{
			VAFE.IntNum[IRQ1] ++;
		}
//	}
}
*/
//=========================================================
//decription	::	AFE configure IRQ0
//function		::	AFE_Configure_IRQ0
//Input			::	none
//Output		::	none
//call			::	pmc_enable_periph_clk,
//					gpio_configure_pin,pio_set_debounce_filter
//effect		::	none
//=========================================================
void	AFE_Configure_IRQ0(void)
{
	pmc_enable_periph_clk( AFE_IRQ0_ID );
	AFE_IRQ0_In();
	AFE_IRQ0_PIO_En();
	AFE_IRQ0_PullUp_En();
	AFE_IRQ0_PIO->PIO_IFER |= AFE_IRQ0_MASK;
	//AFE_IRQ0_PIO->PIO_SCDR =20;
	AFE_IRQ0_PIO->PIO_IFSCER |= AFE_IRQ0_MASK;
	
	//pio_handler_set(AFE_IRQ0_PIO, AFE_IRQ0_ID, AFE_IRQ0_MASK, AFE_IRQ0_ATR, AFE_IRQ0_INT_handler);
    //pio_enable_interrupt(AFE_IRQ0_PIO, AFE_IRQ0_MASK);
	
    //NVIC_DisableIRQ(AFE_IRQ0_IRQn);
    //NVIC_ClearPendingIRQ(AFE_IRQ0_IRQn);
    //NVIC_SetPriority(AFE_IRQ0_IRQn, 0);
    //NVIC_EnableIRQ(AFE_IRQ0_IRQn); 
}
//=========================================================
//decription	::	AFE configure IRQ1
//function		::	AFE_Configure_IRQ1
//Input			::	none
//Output		::	none
//call			::	pmc_enable_periph_clk,
//					gpio_configure_pin,pio_set_debounce_filter
//effect		::	none
//=========================================================
void	AFE_Configure_IRQ1(void)
{
	pmc_enable_periph_clk( AFE_IRQ1_ID );
	AFE_IRQ1_In();
	AFE_IRQ1_PIO_En();
	AFE_IRQ1_PullUp_En();
	AFE_IRQ1_PIO->PIO_IFER |= AFE_IRQ1_MASK;
	//AFE_IRQ1_PIO->PIO_SCDR =20;
	AFE_IRQ1_PIO->PIO_IFSCER |= AFE_IRQ1_MASK;
}
//=========================================================
//decription	::	AFE configure WarmOut
//function		::	AFE_Configure_WarmOut
//Input			::	none
//Output		::	none
//call			::	pmc_enable_periph_clk,
//					gpio_configure_pin,pio_set_debounce_filter
//effect		::	none
//=========================================================
void	AFE_Configure_WarmOut(void)
{
	pmc_enable_periph_clk( AFE_WARMOUT_ID );
	AFE_WARMOUT_In();
	AFE_WARMOUT_PIO_En();
	AFE_IRQ1_PullUp_En();
	AFE_WARMOUT_PIO->PIO_IFER |= AFE_WARMOUT_MASK;
	//AFE_WARMOUT_PIO->PIO_SCDR =20;
	AFE_WARMOUT_PIO->PIO_IFSCER |= AFE_WARMOUT_MASK;
}
//=========================================================
//decription	::	configure AFE interrupt
//function		::	Configure_AFE_Int
//Input			::	none
//Output		::	none
//call			::	none
//effect		::	none
//=========================================================
void	Configure_AFE_Int(void)
{
	switch ( VAFE.id )
	{
		case	AT90E25:
        case	AT90E24:
        case	AT90E23:
		{
			AFE_Configure_ZX0();
			AFE_Configure_CF1();
		}
		break;
        case	AT90E32:
		case	AT90E32A:
		case	AT90E32AS:		
		case	AT90E36:
		case	AT90E36A:
		{
			AFE_Configure_ZX0();
			AFE_Configure_ZX1();
			AFE_Configure_ZX2();

			AFE_Configure_CF1();
			AFE_Configure_CF2();
			AFE_Configure_CF3();
			AFE_Configure_CF3();
						
			//AFE_Configure_IRQ0();
			//AFE_Configure_IRQ1();		
		}
		break;		
		default :
		break;
	}	
}
//=========================================================
//decription	::	AFE SPI bus Inition
//function		::	AFE_SPI_Init
//Input			::	none
//Output		::	none
//call			::	none
//effect		::	none
//=========================================================
void	AFE_SPI_Init(void)
{
	switch ( VAFE.id )
	{
		case	AT90E25:
        case	AT90E24:
        case	AT90E23:
		{
			VAFE.runmode =Nomal_Mode;
		}
		break;
        case	AT90E32:
		case	AT90E32A:
		case	AT90E32AS:		
		case	AT90E36:
		case	AT90E36A:
		{
			AFE_DMA_Out();
			AFE_DMA_DISABLE();
			SET_AFE_MODE( Nomal_Mode );	
			AFE_Configure_IRQ1();
		}
		break;		
		default :
		break;
	}
	AFE_Configure_WarmOut();
	AFE_Configure_IRQ0();
	
	AFE_CS_Out();
	AFE_CS_PullUp_En();
	AFE_CS_DISABLE();
	AFE_SCK_Out();
	AFE_SCK_PullUp_En();
	AFE_SCK_Low();
	AFE_MOSI_Out();
	AFE_MOSI_PullUp_En();
	AFE_MOSI_Low();
	AFE_MISO_In();
	AFE_MISO_PullUp_En();
	AFE_MISO_High();	
}
//=========================================================
//decription	::	identify afe type 
//function		::	Identify_AFE_Type
//Input			::	none
//Output		::	none
//call			::	afe_xx.app()
//effect		::	vafe.id
//=========================================================
void	Identify_AFE_Type(void)
{
	uint32_t	i;
	uint32_t	val;
	uint16_t	adr;
	
