NYUAD-LabOps/Eagle_Parts/PDFs/Power Meter/ATM90E2x_V1.15/Firmware/SAM4C-CB/Atmel Studio 7.0/SAM4C_90e_xx_std/src/app/at90e_xx/at90e_xx.c
	for(i=0;i<13;i++)
	{	
		if( (i&0x1)==0x01 )
		{
			VAFE.id =AT90E25;
			adr =AT90E2x_ChipID_Adr;	//
		}//singal meter
		else
		{			
			VAFE.id =AT90E36;
			adr =AT90E3x_ChipID_Adr;	//
		}//muliti meter		
		AFE_SPI_Init();
		Delay_N_ms(20);
		val=Read_AFE_1Reg( adr );
        __NOP();
        __NOP();
		switch(val)
		{
			case	AT90E25_CHIPID:
			{
                val =Read_AFE_1Reg( 0x16 );
                if( val ==0x8097)
                {
                     VAFE.id =AT90E25;
                     i =15;
                }
                if( val ==0x8077 )
                {
                    VAFE.id =AT90E24;
                    i =15;
                }               
            }
			break;
            case	AT90E23_CHIPID:
			{
				VAFE.id =AT90E23;
				i=15;
			}
			break;
			case	AT90E36_CHIPID:
			{
				val=Read_AFE_1Reg( adr );
				if( val==AT90E36_CHIPID )
				{
					VAFE.id =AT90E36;
					i=15;
				}
			}
			break;
			case	AT90E36A_CHIPID:
			{
				val=Read_AFE_1Reg( adr );
				if( val==AT90E36A_CHIPID )
				{
					VAFE.id =AT90E36A;
					i=15;
				}
			}
			break;
			case	AT90E32_CHIPID:
			{
				val=Read_AFE_1Reg( 0x30 );
				if( val==0x6886 )
				{
					VAFE.id =AT90E32;					
				}
				else
				{				
					VAFE.id =AT90E32AS;//AT90E32AS_VB_CHIPID;
				}
				i=15;
			}
			break;
			case	AT90E32A_CHIPID:
			{
				val=Read_AFE_1Reg( adr );
				if( val==AT90E32A_CHIPID )
				{
					VAFE.id =AT90E32A;
					i=15;
				}
			}
			break;
			case	AT90E32AS_VA_CHIPID:
			{
				val=Read_AFE_1Reg( adr );
				if( val==AT90E32AS_VA_CHIPID )
				{
					VAFE.id =AT90E32AS;
					i=15;
				}				
			}
			break;
		}		
	}
	
	if( i!=16 )
	{
		VAFE.id =0;
	}
	VAFE.sagstatus.HWORD =0;
	VAFE.measure_en_timer =0;
}
//=========================================================
//decription	::	read single register data from AFE via spi bus 
//function		::	Read_AFE_1Reg
//Input			::	regaddr
//Output		::	read out data
//call			::	Delay_N_us()
//effect		::	sck=0
//=========================================================
uint32_t Read_AFE_1Reg(uint16_t regaddr)
{
	uint16_t	adr,delaytm;
	uint8_t		adrlen;
	uint32_t	i;	
	uint32_t	rd_data=0;
	delaytm =1;	
	switch ( VAFE.id )
	{
		case	AT90E25:
        case	AT90E24:
        case	AT90E23:
		{
			adr =(uint16_t )(regaddr&0x7F);
			adr =adr<<8;
			adrlen =8;
            delaytm =8;
		}
		break;
		case	AT90E32:
		case	AT90E32A:
		case	AT90E32AS:		
		case	AT90E36:
		case	AT90E36A:
		{
			adr =(uint16_t )(regaddr&0x7FFF);
			adrlen =16;			
		}
		break;		
		default :
		{
			adrlen =0;
		}
		break;
	}
	adr |=0x8000;
	AFE_CS_ENABLE();
	
	AFE_SCK_Low();
	AFE_MISO_In();
	AFE_MOSI_Out();
	AFE_SCK_Out();
//	__disable_irq();
	for(i=0;i<adrlen;i++)
	{
		if(adr&0x8000)
		{
			AFE_MOSI_High();
		}
		else
		{
			AFE_MOSI_Low();
		}
        Delay_N_us(delaytm);
		AFE_SCK_High();
		Delay_N_us(delaytm);
		AFE_SCK_Low();
		adr=adr<<1;
	}
	for(i=0;i<16;i++)
	{
        Delay_N_us(delaytm);
		AFE_SCK_High();
		rd_data =rd_data<<1;
		Delay_N_us(delaytm);
		if(BIO_AFE_MISO)
		{
			rd_data |=0x01;
		}
		else
		{
			__NOP();
			__NOP();
		}				
		AFE_SCK_Low();
	}
	Delay_N_us(delaytm);
//	__enable_irq();
	AFE_CS_DISABLE();
	Delay_N_us(delaytm);
	if(adrlen==0)
		return(0);
	return(rd_data);
}
//=========================================================
//decription	::	write single register data from AFE via spi bus 
//function		::	write_AFE_1Reg
//Input			::	regaddr,regdata
//Output		::	1=success,0=failure
//call			::	Delay_N_us()
//effect		::	sck=0
//=========================================================
uint32_t write_AFE_1Reg(uint16_t regaddr,uint16_t regdata)
{
	uint16_t    delaytm;
    uint32_t	i;	
	uint32_t	wr_data;
	uint32_t	wr_sck_num;
	
	wr_data =(uint32_t)(regaddr&0x7FFF);
	wr_data =wr_data<<16;	
	wr_data |=(uint32_t)(regdata&0xFFFF);
	delaytm =1;
	switch ( VAFE.id )
	{
		case	AT90E25:
        case	AT90E24:
        case	AT90E23:
		{
			wr_data =wr_data<<8;
			wr_sck_num =24;
            delaytm =8;
		}
		break;
		case	AT90E32:
		case	AT90E32A:
		case	AT90E32AS:		
		case	AT90E36:
		case	AT90E36A:
		{
			wr_sck_num =32;			
		}
		break;		
		default :
		{
			wr_sck_num =0;
		}
		break;
	}	
	AFE_CS_ENABLE();
	
	AFE_SCK_Low();
	AFE_MISO_In();
	AFE_MOSI_Out();
	AFE_SCK_Out();
//	__disable_irq();
	for(i=0;i<wr_sck_num;i++)
	{
		if(wr_data&0x80000000)
		{
			AFE_MOSI_High();
		}
		else
		{
			AFE_MOSI_Low();
		}
        Delay_N_us(delaytm);
		AFE_SCK_High();
		Delay_N_us(delaytm);
		AFE_SCK_Low();
		wr_data=wr_data<<1;
	}
	Delay_N_us(delaytm);	
//	__enable_irq();
	AFE_CS_DISABLE();
	Delay_N_us(delaytm);
	if(wr_sck_num==0)
		return(0);
	return(1);
}
//=========================================================
//decription	::	communicate read AFE single register 
//function		::	CMD_Rd_AFE_Reg
//Input			::	ptr,regaddr
//Output		::	ptr->read out data
//call			::	
//effect		::	sck=0
//=========================================================
uint32_t	CMD_Rd_AFE_Reg( uint8_t *ptr,uint16_t regadr )
{
	uint32_t	val;
	val =Read_AFE_1Reg(regadr);
	__NOP();
	*ptr =(uint8_t)(val);
	*(ptr+1)=(uint8_t)(val>>8);
	return (0x2E);
}
//=========================================================
//decription	::	communicate write AFE single register 
//function		::	CMD_Wr_AFE_Reg
//Input			::	ptr regadr
//Output		::	0x2F->success,0x02->failure
//call			::	write_AFE_1Reg
//effect		::	
//=========================================================
uint32_t	CMD_Wr_AFE_Reg( uint8_t *ptr,uint16_t regadr )
{
	uint16_t	val;
	val =(uint16_t)(*(ptr+1));
	val =val<<8;
    val |=(uint16_t)(*(ptr+0));
	if( write_AFE_1Reg(regadr,val) )
	{
		return (0x2F);
	}
	else
	{
		return (0x02);
	}
}
//=========================================================
//decription	::	sag check
//function		::	Sag_check
//Input			::	none
//Output		::	none
//call			::	VAFE.sagstatus
//effect		::	
//=========================================================
void	Sag_check( void )
{
	uint32_t	val;
	VAFE.sagstatus.HWORD &=0xFF00;
	if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
	{
		val =Read_AFE_1Reg(SysStatus);
		if( val&0x02)
		{
			VAFE.sagstatus.BIT.UaSag =1;
		}
	}
	else
	{
		if( VAFE.id==AT90E32AS )
		{
			val =Read_AFE_1Reg(P3_2AS_EMMState1);
			val =val>>8;
		}
		else
		{
			val =Read_AFE_1Reg(P3_EnStatus1);
		}
		if( val&0x10)
		{
			VAFE.sagstatus.BIT.UcSag =1;
		}
		if( val&0x20)
		{
			VAFE.sagstatus.BIT.UbSag =1;
		}
		if( val&0x40)
		{
			VAFE.sagstatus.BIT.UaSag =1;
		}
	}		
}
//=========================================================
//decription	::	enable harmonic calculate
//function		::	Enable_Harmonic_Calculate
//Input			::	none
//Output		::	none
//call			::	write_AFE_1Reg
//effect		::	thd_timer,thd_status
//=========================================================
void	Enable_Harmonic_Calculate(void)
{
	uint32_t	val;
	val =write_AFE_1Reg( 0x1D1,0x01);	//enable dft calculate
	if(val)
	{
		VAFE.thd_timer =101;	//505ms=101*5ms		
	}
	else
	{
		VAFE.thd_timer =0;
	}
	VAFE.thd_status =IsFailed;
}

//=========================================================
//decription	::	read measure parameter
//function		::	Rd_Measure_Parameter
//Input			::	regh_addr regl_addr
//Output		::	(regh_addr)<<16 + (regl_addr)
//call			::	Read_AFE_1Reg
//effect		::	
//=========================================================
uint32_t	Rd_Measure_Parameter(uint16_t regh_addr,uint16_t regl_addr)
{
	uint32_t	val,val_h,val_l;
	val_h =Read_AFE_1Reg(regh_addr);
	val_l =Read_AFE_1Reg(regl_addr);
	val =Read_AFE_1Reg(regh_addr);
	if(val_h !=val )
	{
		val_h =Read_AFE_1Reg(regh_addr);
		val_l =Read_AFE_1Reg(regl_addr);
	}
	val =val_h<<16;
	val |=val_l;
	
	return(val);
}
//=========================================================
//decription	::	calculate voltage or current mull scale
//function		::	Calculate_V_I_Mul_Scal
//Input			::	rmsval,scale
//Output		::	rmsval*f(scale)
//return		::	result
//call			::	none
//effect		::	
//=========================================================
uint32_t	Calculate_V_I_Mul_Scal(uint32_t rmsval,uint16_t scale)
{
	uint32_t	m;
	m =rmsval;
	switch( scale )
	{
		case	0:
		{
			m =m>>4;
		}
		break;
		case	1:
		{
			m =m>>3;
		}
		break;
		case	2:
		{
			m =m>>2;
		}
		break;
		case	3:
		{
			m =m>>1;
		}
		break;
		case	5:
		{
			m =m<<1;
		}
		break;
		case	6:
		{
			m =m<<2;
		}
		break;
		case	7:
		{
			m =m<<3;
		}
		break;
		case	8:
		{
			m =m<<4;
		}
		break;
	}
	return(m);
}
//=========================================================
//decription	::	calculate voltage or current rms
//function		::	Calculate_V_I_RMS
//Input			::	rmsptr rmsval
//Output		::	rmsval->ptr (0xxx.xxxx) V
//								(xxx.xxxxx) A
//return		::	1:success,3:failed
//call			::	none
//effect		::	
//=========================================================
uint32_t	Calculate_V_I_RMS( uint32_t *rmsptr,uint32_t rmsval)
{
	uint32_t	m;
	
	m =rmsval>>8;
	*rmsptr =(m%1000000)/100000;
	*rmsptr =*rmsptr<<4;	
	*rmsptr |=(m%100000)/10000;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%10000)/1000;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%1000)/100;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%100)/10;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%10);
	
	m =(rmsval%256)*100;
	*rmsptr =*rmsptr<<4;	
	*rmsptr |=(m>>8)/10;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=((m>>8)%10);

	return(1);
}
//=========================================================
//decription	::	calculate power
//function		::	Calculate_Power
//Input			::	rmsptr rmsval
//Output		::	rmsval->ptr   (xxxxx.xxx w)
//call			::	none
//effect		::	
//=========================================================
void	Calculate_Power( uint32_t *rmsptr,uint32_t rmsval )
{
	uint64_t	m;
	if(VAFE.id==AT90E32AS)
	{
		m =rmsval;
        m =m*1000;          // xxxxx.xxx w
		m=m/3125;		//*0.00032w
		*rmsptr =(uint8_t)((m%100000000)/10000000);
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(uint8_t)((m%10000000)/1000000);        
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(uint8_t)((m%1000000)/100000);
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(uint8_t)((m%100000)/10000);
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(uint8_t)((m%10000)/1000);
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(uint8_t)((m%1000)/100);
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(uint8_t)((m%100)/10);
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(uint8_t)((m%10));
	}
	else
	{
		m =rmsval>>8;		//it is interger
		*rmsptr =(m%100000)/10000;
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(m%10000)/1000;
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(m%1000)/100;
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(m%100)/10;
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(m%10);
		
