NYUAD-LabOps/Eagle_Parts/PDFs/Power Meter/ATM90E2x_V1.15/Firmware/SAM4C-CB/Atmel Studio 7.0/SAM4C_90e_xx_std/src/app/at90e_xx/at90e_xx.c
		m =((rmsval%256)*1000);	//it is decimal
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(m>>8)/100;
		*rmsptr =*rmsptr<<4;
		*rmsptr |=((m>>8)%100)/10;
		*rmsptr =*rmsptr<<4;
		*rmsptr |=((m>>8)%10);
	}		
}
//=========================================================
//decription	::	calculate power factor
//function		::	Calculate_PowerFactor
//Input			::	rmsptr rmsval
//Output		::	rmptr->   (x.xxx ) 
//call			::	none
//effect		::	
//=========================================================
void	Calculate_PowerFactor( uint32_t *rmsptr,uint32_t rmsval )
{
	uint32_t	m;

	m =(rmsval&0x7FFF);
	*rmsptr =(m%10000)/1000;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%1000)/100;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%100)/10;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%10);
}
//=========================================================
//decription	::	calculate frequence
//function		::	Calculate_Frequency
//Input			::	rmsptr rmsval
//Output		::	rmsptr-> (xx.xx )
//return		::	1:success,3:failed
//call			::	none
//effect		::	
//=========================================================
uint32_t	Calculate_Frequency( uint32_t *rmsptr,uint32_t rmsval )
{
	uint32_t	m;
	m =rmsval;

	*rmsptr =(m%10000)/1000;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%1000)/100;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%100)/10;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%10);

	return(1);
}
//=========================================================
//decription	::	calculate thdnx
//function		::	Calculate_THDNx
//Input			::	rmsptr rmsval
//Output		::	rmsptr-> (xxxx.xxxx )
//return		::	1:success,3:failed 
//call			::	none
//effect		::	
//=========================================================
uint32_t	Calculate_THDNx( uint32_t *rmsptr,uint32_t rmsval )
{
	uint32_t	m;
	m =rmsval*100;
    
    *rmsptr =(m%100000000)/10000000;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%10000000)/1000000;
    *rmsptr =*rmsptr<<4;
	*rmsptr |=(m%1000000)/100000;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%100000)/10000;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%10000)/1000;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%1000)/100;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%100)/10;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%10);
	
	return(1);
}
//=========================================================
//decription	::	calculate angle
//function		::	Calculate_angle
//Input			::	rmsptr rmsval
//Output		::	rmsptr-> (xxx.x ) 
//call			::	none
//effect		::	
//=========================================================
void	Calculate_angle( uint32_t *rmsptr,uint32_t rmsval )
{
	uint32_t	m;

	m =rmsval&0x7FFF;
	
	*rmsptr =(m%10000)/1000;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%1000)/100;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%100)/10;
	*rmsptr =*rmsptr<<4;
	*rmsptr |=(m%10);	
}
//=========================================================
//decription	::	calculate voltage or current peak
//function		::	Calculate_V_I_Peak
//Input			::	rmsptr rmsval regid
//Output		::	rmsptr->  (xxxx ) V/A
//return		::	1:success,3:failed
//call			::	Read_AFE_1Reg
//effect		::	
//result :: V_peak=rmsval*UxGain/100*2^13
//			I_peak=rmsval*IxGain/1000*2^13
//=========================================================
uint32_t	Calculate_V_I_Peak( uint32_t *rmsptr,uint32_t rmsval,uint32_t regid )
{
	uint32_t	val;
	uint16_t	reg_addr,ratio=0;
	switch(regid)
	{
		case	Ua:
		{
			reg_addr =P3_UGainA;
			ratio =100;
		}
		break;
		case	Ub:
		{
			reg_addr =P3_UGainB;
			ratio =100;
		}
		break;
		case	Uc:
		{
			reg_addr =P3_UGainC;
			ratio =100;
		}
		break;
		case	Ia:
		{
			reg_addr =P3_IGainA;
			ratio =1000;
		}
		break;
		case	Ib:
		{
			reg_addr =P3_IGainB;
			ratio =1000;
		}
		break;
		case	Ic:
		{
			reg_addr =P3_IGainC;
			ratio =1000;
		}
		break;
		
	}
	if(ratio ==100 || ratio ==1000)
	{		
		val =Read_AFE_1Reg(reg_addr);
		val =val*rmsval;
		val =val>>13;
		val =val/ratio;
	
		*rmsptr =(val%100000)/10000;
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(val%1000)/100;
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(val%100)/10;
		*rmsptr =*rmsptr<<4;
		*rmsptr |=(val%10);
		
		return(1);
	}
	else
	{
		*rmsptr =0;
		return(3);
	}		
}
//=========================================================
//decription	::	calculate current or voltage harmonic ratio
//function		::	Calculate_I_V_HarmonicRatio
//Input			::	reg_addr
//Output		::	current or voltage harmonic ratio
//call			::	Read_AFE_1Reg
//effect		::	
//=========================================================
uint32_t	Calculate_I_V_HarmonicRatio( uint16_t reg_addr )
{
	uint32_t	val;
	val =Read_AFE_1Reg(reg_addr);
	val =val*100;
	val =val>>14;
	return (val);		
}
//=========================================================
//decription	::	calculate current or voltage fundaamental 
//function		::	Calculate_I_V_Fundamental
//Input			::	reg_addr,scale
//Output		::	current or voltage harmonic ratio
//call			::	Read_AFE_1Reg
//effect		::	
//=========================================================
float	Calculate_I_V_Fundamental( uint16_t reg_addr,uint16_t scale )
{
	float	val;
	val =3.2656;	
	val =val*Read_AFE_1Reg(reg_addr);	
	val =val/scale;	
	return (val);		
}
//=========================================================
//decription	::	measure rms 
//function		::	Measure_RMS
//Input			::	ptr,rms_id
//Output		::	measure result save into ptr point dada
//return		::	1:success,2:data is negative,3:failed
//call			::	Read_AFE_1Reg,Rd_Measure_Parameter,...
//effect		::	
//=========================================================
uint32_t	Measure_RMS( uint32_t *ptr,const RMS_TYPE rms_id )
{
	uint32_t	val;
	uint32_t	error_type;
//	uint32_t	*ptr;
	error_type =3;	//measure is failed
//	if( VAFE.measure_en_timer !=0 )
//	{
//		VAFE.measure_en_timer--;
//		return( error_type );
//	}
	switch( rms_id)
	{
		case	Ua:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{
				val =Rd_Measure_Parameter((uint16_t)P3_UrmsA,(uint16_t)P3_UrmsALSB);
				val =val>>8;
				//val =val*VAFE.ulscal.BIT.U_SCALE;
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Ua];      
                error_type =Calculate_V_I_RMS( ptr,val);				
			}
			if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
			{
				val =Read_AFE_1Reg(Urms);
				//val =val*VAFE.ulscal.BIT.U_SCALE;
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				val =val<<8;		//*256
				//ptr =&VAFE.RMS[Ua];      
                error_type =Calculate_V_I_RMS( ptr,val);
			}
		}
		break;
		case	Ub:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{
				val =Rd_Measure_Parameter((uint16_t)P3_UrmsB,(uint16_t)P3_UrmsBLSB);
				val =val>>8;
				//val =val*VAFE.ulscal.BIT.U_SCALE;
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Ub];
				error_type =Calculate_V_I_RMS( ptr,val);
			}							
		}
		break;
		case	Uc:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{
				val =Rd_Measure_Parameter((uint16_t)P3_UrmsC,(uint16_t)P3_UrmsCLSB);
				val =val>>8;
				//val =val*VAFE.ulscal.BIT.U_SCALE;
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Uc];
				error_type =Calculate_V_I_RMS( ptr,val);
			}							
		}
		break;		
		case	Ia:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{
				val =Rd_Measure_Parameter((uint16_t)P3_IrmsA,(uint16_t)P3_IrmsALSB);
				val =val>>8;
				//val =val*VAFE.ulscal.BIT.I_SCALE;
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				//ptr =&VAFE.RMS[Ia];
				error_type =Calculate_V_I_RMS( ptr,val);
			}
			if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
			{
				val =Read_AFE_1Reg(Irms);
				//val =val*VAFE.ulscal.BIT.I_SCALE;
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =val<<8;		//*256
				//ptr =&VAFE.RMS[Ia];      
                error_type =Calculate_V_I_RMS( ptr,val);
			}
		}
		break;
		case	Ib:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{
				val =Rd_Measure_Parameter((uint16_t)P3_IrmsB,(uint16_t)P3_IrmsBLSB);				
				val =val>>8;
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				//ptr =&VAFE.RMS[Ib];
				error_type =Calculate_V_I_RMS( ptr,val);
			}							
		}
		break;
		case	Ic:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{
				val =Rd_Measure_Parameter((uint16_t)P3_IrmsC,(uint16_t)P3_IrmsCLSB);
				val =val>>8;			
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				//ptr =&VAFE.RMS[Ic];
				error_type =Calculate_V_I_RMS( ptr,val);
			}			
		}
		break;
		case	In:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{
				val	=Read_AFE_1Reg((uint16_t)P3_IrmsN0);				
				//val =val*VAFE.ulscal.BIT.I_SCALE;
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =val<<8;		//*256
				//ptr =&VAFE.RMS[In];
				error_type =Calculate_V_I_RMS( ptr,val);
			}
			if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
			{
				val =Read_AFE_1Reg(Irms2);
				//val =val*VAFE.ulscal.BIT.I_SCALE;
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);				
				val =val<<8;	//*256
				//ptr =&VAFE.RMS[In];      
                error_type =Calculate_V_I_RMS( ptr,val);
			}
		}
		break;
		case	Pt:
		{			
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val =Rd_Measure_Parameter((uint16_t)P3_PmeanT,(uint16_t)P3_PmeanTLSB);			
				if((val&0x80000000)==0x80000000)
				{
					val = (~val)+1;
					error_type =2;
					VAFE.sagstatus.BIT.PTDir =1;
				}
				else
				{
					error_type =1;
					VAFE.sagstatus.BIT.PTDir =0;
				}
				if(VAFE.id!=AT90E32AS)
				{
					val =val>>6;		//*4
				}							
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Pt];
				Calculate_Power( ptr,val );
			}			
		}
		break;	
		case	Pa:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val =Rd_Measure_Parameter((uint16_t)P3_PmeanA,(uint16_t)P3_PmeanALSB);			
				if((val&0x80000000)==0x80000000)
				{
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
                if(VAFE.id!=AT90E32AS)
				{
					val =val>>8;		//
				}
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Pa];
				Calculate_Power( ptr,val );
			}
			if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
			{
				val =Read_AFE_1Reg(Pmean);
				if((val&0x8000)==0x8000)
				{
					val = (~val)+1;
					error_type =2;
					VAFE.sagstatus.BIT.PTDir =1;
				}
				else
				{
					error_type =1;
					VAFE.sagstatus.BIT.PTDir =0;
				}
				val =(val&0x7FFF);
				val =val<<8;	//*256
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[In];      
                Calculate_Power( ptr,val);
			}								
		}
		break;
		case	Pb:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val =Rd_Measure_Parameter((uint16_t)P3_PmeanB,(uint16_t)P3_PmeanBLSB);			
				if((val&0x80000000)==0x80000000)
				{
					val = (~val)+1;					
					error_type =2;
				}
				else
				{
					error_type =1;
				}
                if(VAFE.id!=AT90E32AS)
				{
					val =val>>8;		//
				}
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Pb];
				Calculate_Power( ptr,val );	
			}			
		}		
		break;
		case	Pn:
		{			
			if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
			{
				val =Read_AFE_1Reg(Pmean2);
				if((val&0x8000)==0x8000)
				{
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
				val =(val&0x7FFF);
				val =val<<8;	//*256
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);				
				//ptr =&VAFE.RMS[Pn];      
                Calculate_Power( ptr,val);
			}
		}
		break;
		case	Pc:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val =Rd_Measure_Parameter((uint16_t)P3_PmeanC,(uint16_t)P3_PmeanCLSB);			
				if((val&0x80000000)==0x80000000)
				{
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
                if(VAFE.id!=AT90E32AS)
				{
					val =val>>8;		//
				}
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Pc];
				Calculate_Power( ptr,val );				
			}									
		}
		break;
		case	Qt:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val =Rd_Measure_Parameter((uint16_t)P3_QmeanT,(uint16_t)P3_QmeanTLSB);			
				if((val&0x80000000)==0x80000000)
				{
					val = (~val)+1;
					error_type =2;
					VAFE.sagstatus.BIT.QTDir =1;
				}
				else
				{
					error_type =1;
					VAFE.sagstatus.BIT.QTDir =0;
				}
                if(VAFE.id!=AT90E32AS)
				{
					val =val>>6;		//*4
				}
				//else
				//{
				//	val =val<<2;		//*4
				//}
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Qt];
				Calculate_Power( ptr,val );
			}		
		}
		break;		
		case	Qa:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val =Rd_Measure_Parameter((uint16_t)P3_QmeanA,(uint16_t)P3_QmeanALSB);			
				if((val&0x80000000)==0x80000000)
				{
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
                if(VAFE.id!=AT90E32AS)
				{
					val =val>>8;		//
				}
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Qa];
				Calculate_Power( ptr,val );
			}			
			if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
			{
				val =Read_AFE_1Reg(Qmean);
				if((val&0x8000)==0x8000)
				{
					val = ~val;
					error_type =2;
					VAFE.sagstatus.BIT.QTDir =1;
				}
				else
				{
					error_type =1;
					VAFE.sagstatus.BIT.QTDir =0;
				}
				val &=0x7FFF;
				val =val<<8;	//*256
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Qa];      
                Calculate_Power( ptr,val);
			}		
		}
		break;
		case	Qb:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val =Rd_Measure_Parameter((uint16_t)P3_QmeanB,(uint16_t)P3_QmeanBLSB);			
				if((val&0x80000000)==0x80000000)
				{
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
                if(VAFE.id!=AT90E32AS)
				{
					val =val>>8;		//
				}
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Qb];
				Calculate_Power( ptr,val );				
			}			
		}
		break;
		case	Qn:
		{			
			if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
			{
				val =Read_AFE_1Reg(Qmean2);
				if((val&0x8000)==0x8000)
				{
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
				val &=0x7FFF;
				val =val<<8;	//*256
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Qn];      
                Calculate_Power( ptr,val);
			}
		}
		break;
		case	Qc:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val =Rd_Measure_Parameter((uint16_t)P3_QmeanC,(uint16_t)P3_QmeanCLSB);			
				if((val&0x80000000)==0x80000000)
				{
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
                if(VAFE.id!=AT90E32AS)
				{
					val =val>>8;		//
				}
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Qc];
				Calculate_Power( ptr,val );				
			}					
		}
		break;
		case	SAt:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val =Rd_Measure_Parameter((uint16_t)P3_SAmeanT,(uint16_t)P3_SAmeanTLSB);			
				if((val&0x80000000)==0x80000000)
				{
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
                if(VAFE.id!=AT90E32AS)
				{
					val =val>>6;		//*4
				}
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[SAt];
				Calculate_Power( ptr,val );				
			}									
		}
		break;
		case	SVt:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A)
			{			
				val =Rd_Measure_Parameter((uint16_t)P3_SVmeanT,(uint16_t)P3_SVmeanTLSB);
				if( (val&0x80000000) ==0x80000000)
				{
					val =(~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
				val =val>>14;		//val=val*(4/65536)
                //val =val*VAFE.ulscal.BIT.I_SCALE;
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				*ptr =(val%100000000)/10000000;		// (xxxxx.xxx) VA
				*ptr =*ptr <<4;
				*ptr |=(val%10000000)/1000000;
				*ptr =*ptr <<4;
				*ptr |=(val%1000000)/100000;
				*ptr =*ptr <<4;
				*ptr |=(val%100000)/10000;
				*ptr =*ptr <<4;
				*ptr |=(val%10000)/1000;
				*ptr =*ptr <<4;
				*ptr |=(val%1000)/100;
				*ptr =*ptr <<4;
				*ptr |=(val%100)/10;
				*ptr =*ptr <<4;
				*ptr |=(val%10);				
							
