NYUAD-LabOps/Eagle_Parts/PDFs/Power Meter/ATM90E2x_V1.15/Firmware/SAM4C-CB/Atmel Studio 7.0/SAM4C_90e_xx_std/src/app/at90e_xx/at90e_xx.c
			}											
		}
		break;
		case	Sa:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val =Rd_Measure_Parameter((uint16_t)P3_SmeanA,(uint16_t)P3_SmeanALSB);			
				if((val&0x80000000)==0x80000000)
				{
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
                if(VAFE.id!=AT90E32AS)
				{
					val =val>>8;		//
				}
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Sa];
				Calculate_Power( ptr,val );	
			}
			if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
			{
				val =Read_AFE_1Reg(Smean);
				if((val&0x8000)==0x8000)
				{
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
				val =(val&0x7FFF);
				val =val<<8;	//*256
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Sa];      
                Calculate_Power( ptr,val);
			}
		}
		break;
		case	Sb:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val =Rd_Measure_Parameter((uint16_t)P3_SmeanB,(uint16_t)P3_SmeanBLSB);			
				if((val&0x80000000)==0x80000000)
				{
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
                if(VAFE.id!=AT90E32AS)
				{
					val =val>>8;		//
				}	
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Sb];
				Calculate_Power( ptr,val );
			}
		}
		break;
		case	Sn:
		{
			if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
			{
				val =Read_AFE_1Reg(Smean2);
				if((val&0x8000)==0x8000)
				{
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
				val =(val&0x7FFF);
				val =val<<8;	//*256
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Sn];      
                Calculate_Power( ptr,val);
			}
		}
		break;
		case	Sc:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val =Rd_Measure_Parameter((uint16_t)P3_SmeanC,(uint16_t)P3_SmeanCLSB);			
				if((val&0x80000000)==0x80000000)
				{
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
                if(VAFE.id!=AT90E32AS)
				{
					val =val>>8;		//
				}
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.I_SCALE);
				val =Calculate_V_I_Mul_Scal(val,VAFE.ulscal.BIT.U_SCALE);
				//ptr =&VAFE.RMS[Sc];
				Calculate_Power( ptr,val );	
			}								
		}
		break;
		case	PFt:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_PFmeanT);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}				
				val =(val &0x7FFF);				
				//ptr =&VAFE.RMS[PFt];
				Calculate_PowerFactor( ptr,val );
			}			
		}
		break;
		case	PFa:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_PFmeanA);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
				val =(val &0x7FFF);
				//ptr =&VAFE.RMS[PFa];
				Calculate_PowerFactor( ptr,val );
			}
			if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
			{
				val	=Read_AFE_1Reg((uint16_t)PowerF);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}				
				val =(val &0x7FFF);
				//ptr =&VAFE.RMS[PFa];
				Calculate_PowerFactor( ptr,val );
			}
		}
		break;
		case	PFb:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_PFmeanB);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}
				val =(val &0x7FFF);
				//ptr =&VAFE.RMS[PFb];
				Calculate_PowerFactor( ptr,val );
			}												
		}
		break;
		case	PFn:
		{
			if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
			{			
				val	=Read_AFE_1Reg((uint16_t)PowerF2);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}				
				val =(val &0x7FFF);	
				//ptr =&VAFE.RMS[PFn];
				Calculate_PowerFactor( ptr,val );
			}												
		}
		break;
		case	PFc:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_PFmeanC);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}				
				val =(val &0x7FFF);
				//ptr =&VAFE.RMS[PFc];
				Calculate_PowerFactor( ptr,val );
			}										
		}
		break;			
		case	Frq:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_Freq);
				error_type =1;
				//ptr =&VAFE.RMS[Frq];
				Calculate_Frequency( ptr,val );
			}
			if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
			{			
				val	=Read_AFE_1Reg((uint16_t)Freq);
				error_type =1;
				//ptr =&VAFE.RMS[Frq];
				Calculate_Frequency( ptr,val );
			}
		}
		break;		
		case	Pha:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS )
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_PangleA);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}				
				val =(val &0x7FFF);
				//ptr =&VAFE.RMS[Pha];
				Calculate_angle( ptr,val );
			}			
			if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
			{
				val	=Read_AFE_1Reg((uint16_t)Pangle);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}				
				val =(val &0x7FFF);
				//ptr =&VAFE.RMS[Pha];
				Calculate_angle( ptr,val );
			}
		}
		break;
		case	Phb:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_PangleB);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}				
				val =(val &0x7FFF);
				//ptr =&VAFE.RMS[Phb];
				Calculate_angle( ptr,val );
			}				
		}
		break;
		case	Phn:
		{
			if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
			{			
				val	=Read_AFE_1Reg((uint16_t)Pangle2);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}				
				val =(val &0x7FFF);
				//ptr =&VAFE.RMS[Phn];
				Calculate_angle( ptr,val );
			}				
		}
		break;
		case	Phc:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				//val =Rd_Measure_Parameter((uint16_t)P3_PangleC,(uint16_t)P3_PangleC);			
				//val =val>>16;		//
				val	=Read_AFE_1Reg((uint16_t)P3_PangleC);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}				
				val =(val &0x7FFF);
				//ptr =&VAFE.RMS[Phc];
				Calculate_angle( ptr,val );
			}				
		}
		break;
		case	Temperature:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				//val =Rd_Measure_Parameter((uint16_t)P3_Temp,(uint16_t)P3_Temp);			
				//val =val>>16;		//
				val	=Read_AFE_1Reg((uint16_t)P3_Temp);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}				
				val =(val &0x7FFF);
				//ptr =&VAFE.RMS[Temperature];
				Calculate_angle( ptr,val );
			}				
		}
		break;
		case	UangleA:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_UangleA);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}				
				val =(val &0x7FFF);
				//ptr =&VAFE.RMS[UangleA];
				Calculate_angle( ptr,val );
			}				
		}
		break;
		case	UangleB:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_UangleB);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}				
				val =(val &0x7FFF);
				//ptr =&VAFE.RMS[UangleB];
				Calculate_angle( ptr,val );
			}				
		}
		break;
		case	UangleC:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A || VAFE.id==AT90E32AS)
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_UangleC);
				if( (val&0x8000)==0x8000 )
				{					
					val = (~val)+1;
					error_type =2;
				}
				else
				{
					error_type =1;
				}				
				val =(val &0x7FFF);
				//ptr =&VAFE.RMS[UangleC];
				Calculate_angle( ptr,val );
			}				
		}
		break;
		case	THDNUA:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A )
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_THDUA);

