NYUAD-LabOps/Eagle_Parts/PDFs/Power Meter/ATM90E2x_V1.15/Firmware/SAM4C-CB/Atmel Studio 7.0/SAM4C_90e_xx_std/src/app/at90e_xx/at90e_xx.c
				//ptr =&VAFE.RMS[THDNUA];
				error_type =Calculate_THDNx( ptr,val );
			}				
		}
		break;
		case	THDNUB:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A )
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_THDUB);

				//ptr =&VAFE.RMS[THDNUB];
				error_type =Calculate_THDNx( ptr,val );
			}				
		}
		break;
		case	THDNUC:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A )
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_THDUC);

				//ptr =&VAFE.RMS[THDNUC];
				error_type =Calculate_THDNx( ptr,val );
			}				
		}
		break;
		case	THDNIA:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A )
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_THDIA);

				//ptr =&VAFE.RMS[THDNIA];
				error_type =Calculate_THDNx( ptr,val );
			}				
		}
		break;
		case	THDNIB:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A )
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_THDIB);

				//ptr =&VAFE.RMS[THDNIB];
				error_type =Calculate_THDNx( ptr,val );
			}				
		}
		break;
		case	THDNIC:
		{
			if(VAFE.id==AT90E36 || VAFE.id==AT90E36A 
				||VAFE.id==AT90E32 || VAFE.id==AT90E32A )
			{			
				val	=Read_AFE_1Reg((uint16_t)P3_THDIC);

				//ptr =&VAFE.RMS[THDNIC];
				error_type =Calculate_THDNx( ptr,val );
			}				
		}
		break;
		case	UPeak_A:
		{
			if(VAFE.id==AT90E32AS)
			{
				val	=Read_AFE_1Reg((uint16_t)P3_UPeakA);	//UPeakA=val*UaGain/100*2^13

				//ptr =&VAFE.RMS[UPeak_A];
				error_type=Calculate_V_I_Peak( ptr,val,Ua );
			}
		}
		break;
		case	UPeak_B:
		{
			if(VAFE.id==AT90E32AS)
			{
				val	=Read_AFE_1Reg((uint16_t)P3_UPeakB);	//UPeakB=val*UbGain/100*2^13

				//ptr =&VAFE.RMS[UPeak_B];
				error_type=Calculate_V_I_Peak( ptr,val,Ub );
			}
		}
		break;
		case	UPeak_C:
		{
			if(VAFE.id==AT90E32AS)
			{
				val	=Read_AFE_1Reg((uint16_t)P3_UPeakC);	//UPeakC=val*UcGain/100*2^13

				//ptr =&VAFE.RMS[UPeak_C];
				error_type=Calculate_V_I_Peak( ptr,val,Uc );
			}
		}
		break;
		case	IPeak_A:
		{
			if(VAFE.id==AT90E32AS)
			{
				val	=Read_AFE_1Reg((uint16_t)P3_IPeakA);	//IPeakA=val*IaGain/1000*2^13

				//ptr =&VAFE.RMS[IPeak_A];
				error_type=Calculate_V_I_Peak( ptr,val,Ia );
			}
		}
		break;
		case	IPeak_B:
		{
			if(VAFE.id==AT90E32AS)
			{
				val	=Read_AFE_1Reg((uint16_t)P3_IPeakB);	//IPeakB=val*IbGain/1000*2^13

				//ptr =&VAFE.RMS[IPeak_B];
				error_type=Calculate_V_I_Peak( ptr,val,Ib );
			}
		}
		break;
		case	IPeak_C:
		{
			if(VAFE.id==AT90E32AS)
			{
				val	=Read_AFE_1Reg((uint16_t)P3_IPeakC);	//IPeakC=val*IcGain/1000*2^13

				//ptr =&VAFE.RMS[IPeak_C];
				error_type=Calculate_V_I_Peak( ptr,val,Ic );
			}
		}
		break;
		
		case	CNFStart:
		{
			if( (VAFE.id !=AT90E25) &&(VAFE.id !=AT90E24) &&(VAFE.id !=AT90E23) && (VAFE.id !=AT90E32AS) )
			{
				val =Read_AFE_1Reg(P3_ConfigStart);
				//ptr =&VAFE.RMS[CNFStart];
				*ptr =(uint8_t)(val>>8);
				*ptr =*ptr<<8;
				*ptr |=(uint8_t)(val);
					
				error_type =1;
			}			
		}
		break;
		case	CALStart:
		{
			val =0;
			if( VAFE.id==AT90E25 || VAFE.id==AT90E24 || VAFE.id==AT90E23 )
			{
				val =Read_AFE_1Reg(CalStart);
			}
			else
			{
				if(VAFE.id!=AT90E32AS)
				{
					val =Read_AFE_1Reg(P3_CalStart);
				}
			}
			//ptr =&VAFE.RMS[CALStart];
			*ptr =(uint8_t)(val>>8);
			*ptr =*ptr<<8;
			*ptr |=(uint8_t)(val);
			
			error_type =1;
		}
		break;
		case	HMStart:
		{
			if( (VAFE.id !=AT90E25) &&(VAFE.id !=AT90E24) &&(VAFE.id !=AT90E23) && (VAFE.id !=AT90E32AS) )
			{
				val =Read_AFE_1Reg(P3_HarmStart);
				//ptr =&VAFE.RMS[HMStart];				
				*ptr =(uint8_t)(val>>8);
				*ptr =*ptr<<8;
				*ptr |=(uint8_t)(val);
			
				error_type =1;
			}
		}
		break;
		case	ADJStart:
		{
			val =0;
			if( VAFE.id==AT90E25 || VAFE.id==AT90E24 || VAFE.id==AT90E23  )
			{
				val =Read_AFE_1Reg(AdjStart);
			}
			else
			{
				if(VAFE.id!=AT90E32AS)
				{
					val =Read_AFE_1Reg(P3_AdjStart);
				}
			}
			//ptr =&VAFE.RMS[ADJStart];
			*ptr =(uint8_t)(val>>8);
			*ptr =*ptr<<8;
			*ptr |=(uint8_t)(val);
			
			error_type =1;
		}
		break;	
		case	SYSStatus0:
		{
			if( VAFE.id==AT90E25 || VAFE.id==AT90E24 || VAFE.id==AT90E23  )
			{
				*ptr =Read_AFE_1Reg(SysStatus);
			}
			else
			{
				if(VAFE.id==AT90E32AS)
				{
					*ptr =Read_AFE_1Reg(P3_2AS_EMMState0);
				}
				else
				{
					*ptr =Read_AFE_1Reg(P3_SysStatus0);
				}
			}
			error_type =1;
		}
		break;
		case	SYSStatus1:
		{
			if(VAFE.id==AT90E32AS)
			{
				*ptr =Read_AFE_1Reg(P3_2AS_EMMState1);
			}
			else
			{
				if( (VAFE.id !=AT90E25) && (VAFE.id !=AT90E24) && (VAFE.id !=AT90E23) )
				{
					*ptr =Read_AFE_1Reg(P3_SysStatus1);
				}
			}
			error_type =1;
		}
		break;
		case	FUNCEn0:
		{
			if( (VAFE.id ==AT90E25) || (VAFE.id ==AT90E24) || (VAFE.id ==AT90E23) )
			{
				val =Read_AFE_1Reg(FuncEn);
			}
			else
			{
				if(VAFE.id==AT90E32AS)
				{
					val =Read_AFE_1Reg(P3_2AS_EMMIntEn0);
				}
				else
				{
					val =Read_AFE_1Reg(P3_FuncEn0);
				}
			}
			*ptr =val;
			error_type =1;
		}
		break;
		case	FUNCEn1:
		{
			if( (VAFE.id !=AT90E25) && (VAFE.id !=AT90E24) && (VAFE.id !=AT90E23) )
			{
				if(VAFE.id==AT90E32AS)
				{
					*ptr =Read_AFE_1Reg(P3_2AS_EMMIntEn1);
				}
				else
				{
					*ptr =Read_AFE_1Reg(P3_FuncEn1);
				}
			}
			error_type =1;
		}
		break;
		
	}
	if( VAFE.id ==0)
	{
		*ptr =0;
	}
	
	return(error_type);
}

//=========================================================
//decription	::	load afe calibration parameter from eeprom 
//function		::	Load_AFE_Cal_Para_From_Eprom
//Input			::	none
//Output		::	none
//call			::	RdE2DataCRC,CMD_Wr_AFE_Reg
//effect		::	VAFE.RMS[x]
//=========================================================
void	Load_AFE_Cal_Para_From_Eprom(void)
{
    uint32_t    i,j;
    uint8_t buff[16];
		
	VAFE.dft_scale.BIT.DFT_AI =1;
	VAFE.dft_scale.BIT.DFT_BI =1;
	VAFE.dft_scale.BIT.DFT_CI =1;
	VAFE.dft_scale.BIT.DFT_AV =1;
	VAFE.dft_scale.BIT.DFT_BV =1;
	VAFE.dft_scale.BIT.DFT_CV =1;
	VAFE.thd_status =IsFailed;
	VAFE.thd_timer =0;
	
	if( (VAFE.id ==AT90E25) || (VAFE.id ==AT90E24) || (VAFE.id ==AT90E23) )
	{
		RdE2DataCRC( E2_AT90E2x_UIScal,(uint8_t *)(&VAFE.ulscal.HFWORD),2 );
	}
	else
	{
		RdE2DataCRC( E2_AT90E3x_UIScal,(uint8_t *)(&VAFE.ulscal.HFWORD),2 );
	}
    if( (VAFE.ulscal.BIT.U_SCALE)>8 )
    {
        VAFE.ulscal.BIT.U_SCALE =4;
    }
    if( (VAFE.ulscal.BIT.I_SCALE)>8 )
    {
        VAFE.ulscal.BIT.I_SCALE =5;
    }  
	
	for(i=0;i<RMS_Num_Max;i++)
	{
		VAFE.RMS[i]=0;
	}
		
	if( (VAFE.id==AT90E25) || (VAFE.id==AT90E24) || (VAFE.id==AT90E23) )
	{	
		for(i=0;i<(AFE90E2x_cmd_reg_E2_NumMax/7);i++)
		{										
			RdE2DataCRC( afe90e2x_cmd_reg_e2adr_tbl[i*7].e2adr,(uint8_t *)(&buff[0]),14 );
			//COPYBYTEDATA((uint8_t *)(&buff[0]),(uint8_t *)(&VAFE.test[0]),14);
            for(j=0;j<7;j++)
			{										
				CMD_Wr_AFE_Reg( (uint8_t *)(&buff[0])+(uint16_t)(j<<1),afe90e2x_cmd_reg_e2adr_tbl[(i*7)+j].regadr );
			}			
		}
		if( (i*7)<AFE90E2x_cmd_reg_E2_NumMax )
		{
			RdE2DataCRC( afe90e2x_cmd_reg_e2adr_tbl[(i<<3)-i].e2adr,(uint8_t *)(&buff[0]),(AFE90E2x_cmd_reg_E2_NumMax-(i*7))<<1 );	
			for(j=0;j<(AFE90E2x_cmd_reg_E2_NumMax-(i*7));j++)
			{										
				CMD_Wr_AFE_Reg( (uint8_t *)(&buff[0])+(uint16_t)(j<<1),afe90e2x_cmd_reg_e2adr_tbl[(i*7)+j].regadr );
			}							
		}		
	}
	else
	{	
        if(VAFE.id==AT90E32AS)
        {
            buff[0]=0xAA;
            buff[1]=0x55;
            CMD_Wr_AFE_Reg(&buff[0],0x7F);
        }
      
		for(i=0;i<(AFE90E3x_cmd_reg_E2_NumMax/8);i++)
		{
			EEPROMreader( afe90e3x_cmd_reg_e2adr_tbl[i*8].e2adr,(uint8_t *)(&buff[0]),16);			
			for(j=0;j<8;j++)
			{										
				CMD_Wr_AFE_Reg( (uint8_t *)(&buff[0])+(uint16_t)(j<<1),afe90e3x_cmd_reg_e2adr_tbl[(i*8)+j].regadr );
			} 
		}
		if( (i*8)<AFE90E3x_cmd_reg_E2_NumMax )
		{
			EEPROMreader( afe90e3x_cmd_reg_e2adr_tbl[(i<<3)].e2adr,(uint8_t *)(&buff[0]),(AFE90E3x_cmd_reg_E2_NumMax-(i*8))<<1);
			for(j=0;j<(AFE90E3x_cmd_reg_E2_NumMax-(i*8));j++)
			{										
				CMD_Wr_AFE_Reg( (uint8_t *)(&buff[0])+(uint16_t)(j<<1),afe90e3x_cmd_reg_e2adr_tbl[(i*8)+j].regadr );
			}																				
		}									
	}
		
}





/// @cond 0
/**INDENT-OFF**/
#ifdef __cplusplus
}
#endif
/**INDENT-ON**/
/// @endcond

/**
 * \}
 */
